/**/
"Cancel" = "Cancelar";
/**/
"Delete" = "Eliminar";
/**/
"Open" = "Abrir";
/**/
"Edit" = "Editar";
/**/
"Yes" = "Sim";
/**/
"Finish" = "Terminar";
/**/
"Done" = "Terminado";
/**/
"Save" = "Guardar";
/**/
"Undo" = "Anular";
/**/
"Redo" = "Refazer";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Sim Eliminar";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Aplicar Geometria";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Limpar Geometria";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Eliminar Vértice";
/*Geometry Edit Action Name*/
"Insert Part" = "Inserir Parte";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Inserir Vértice";
/*Geometry Edit Action Name*/
"Move Vertex" = "Mover Vértice";
/*Geometry Edit Action Name*/
"Remove Part" = "Remover Parte";

/*Collecting attachments*/
"Add" = "Adicionar";
/*Collecting attachments*/
"Take Photo or Video" = "Obter foto ou vídeo";
/*Collecting attachments*/
"Choose From Library" = "Escolher da biblioteca";
/*Collecting attachments*/
"Photo" = "Foto";
/*Collecting attachments*/
"Video" = "Vídeo";
/*Collecting attachments*/
"Save To Photo Library" = "Guardar na biblioteca de imagens";
/*Collecting attachments*/
"Download" = "Descarregar";

/*Date attribute*/
"Today" = "Hoje";

/**/
"Attachments" = "Anexos";
"Attributes" = "Atributos";

/**/
"Open in Safari" = "Abrir no Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Introduza um número entre %i e %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Introduza um número entre %@ e %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Demasiados caracteres (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "O número está fora do intervalo aceitável.";

/* BLOB, RASTER, etc */
"Field type not supported" = "O tipo de campo não é suportado";

/**/
"%d of %d" = "%d de %d";

/**/
"Changing Feature Type" = "A alterar o tipo de elemento";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Está a alterar o tipo de elemento, o que possivelmente poderá substituir alguns valores de campos. Tem a certeza de que deseja fazer isso?";

/**/
"Deleting Feature" = "A Eliminar Elemento";
"Are you sure you want to delete this feature?" = "Tem a certeza que pretende eliminar este elemento?";

/**/
"Data for pie chart is invalid" = "Os dados para o gráfico circular não são válidos";
"No data to create a pie chart" = "Não existem dados para criar um gráfico circular";
"No image to display" = "Nenhuma imagem para exibir";

/**/
"Created by %@ seconds ago" = "Criado por %@ segundos atrás";

/**/
"Created by %@ a minute ago" = "Criado por %@ um minuto atrás";

/**/
"Edited by %@ seconds ago" = "Editado por %@ segundos atrás";

/**/
"Edited by %@ a minute ago" = "Editado por %@ um minuto atrás";

/**/
"Created seconds ago" = "Criado segundos atrás";

/**/
"Created a minute ago" = "Criado um minuto atrás";

/**/
"Edited seconds ago" = "Editado segundos atrás";

/**/
"Edited a minute ago" = "Editado um minuto atrás";

/**/
"Created by %@ %d minutes ago" = "Criado por %@ %d minutos atrás";

/**/
"Created by %@ an hour ago" = "Criado por %@ uma hora atrás";

/**/
"Created by %@ %d hours ago" = "Criado por %@ %d horas atrás";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Criado por %@ no %@ às %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Criado por %@ no %@ às %@";

/**/
"Edited by %@ %d minutes ago" = "Editado por %@ %d minutos atrás";

/**/
"Edited by %@ an hour ago" = "Editado por %@ uma hora atrás";

/**/
"Edited by %@ %d hours ago" = "Editado por %@ %d horas atrás";

/**/
"Edited by %@ on %@ at %@ - day" = "Editado por %@ no %@ às %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Editado por %@ no %@ às %@";

/**/
"Created by %@" = "Criado por %@";

/**/
"Edited by %@" = "Editado por %@";

/**/
"Created %d minutes ago" = "Criado %d minutos atrás";

/**/
"Created an hour ago" = "Criado uma hora atrás";

/**/
"Created %d hours ago" = "Criado %d horas atrás";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Criado no %@ às %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Criado no %@ às %@";

/**/
"Edited %d minutes ago" = "Editado %d minutos atrás";

/**/
"Edited an hour ago" = "Editado uma hora atrás";

/**/
"Edited %d hours ago" = "Editado %d horas atrás";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Editado em %@ às %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Editado em %@ às %@";

/* Used to denote a required field */
"Required" = "Obrigatório";

/* Used for naming layers with no names */
"Layer %d" = "Camada %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Não é possível encontrar endereço para a localização";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Não é possível encontrar localização para o endereço";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Não é possível ler o endereço";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Ficheiro não encontrado";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Não é possível carregar o localizador";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Erro interno do localizador";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Geocodificação de interseções não é suportado pelo localizador";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Propriedades não válidas do localizador";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Está a faltar um campo requerido";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "O localizador não está iniciado";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Formato de localizador não suportado";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Transformação de projeções não suportada";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Referência espacial não suportada";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Reverse geocoding não é suportado neste locator.";

/* Network analyst errors */
"Cannot open network." = "Não é possível abrir a rede.";
"Cannot retrieve route task parameters." = "Não é possível obter os parâmetros da tarefa de rota.";
"Insufficient number of stops." = "Número insuficiente de paragens.";
"Stop (%@) was not located." = "A paragem (%@) não foi localizada.";
"Stop (%@) is located on a non traversable element." = "A paragem (%@) está localizada num elemento não atravessável.";
"Stop (%@) is located on a soft restricted element." = "A paragem (%@) está localizada num elemento restrito soft.";
"Point barrer (%@) was not located." = "Não foi possível localizar a barreira de pontos (%@).";
"Point barrier (%@) has invalid added cost attribute name." = "A barreira de ponto (%@) possui um nome de atributo de custo acrescentado não válido.";
"Line barrier (%@) has invalid scaled cost attribute name." = "A barreira de linha (%@) possui um nome de atributo de custo escalado não válido.";
"Line barrier (%@) does not cover any network elements." = "A barreira de linhas (%@) não cobre nenhum elemento de rede.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "A barreira de polígono (%@) possui um nome de atributo de custo escalado não válido.";
"Polygon barrier (%@) does not cover any network elements." = "A barreira de polígono (%@) não cobre nenhum elemento da rede.";
"'%@' is an invalid impedance attribute." = "'%@' é um atributo de impedância inválido.";
"'%@' restriction attribute is invalid." = "O atributo de restrição '%@' é inválido.";
"'%@' accumulate attribute is invalid." = "'%@' atributo de acumulação não é válido.";
"'%@' is an invalid directions time attribute." = "'%@' é um atributo de tempo de direções de condução não válido.";
"Directions distance attribute is invalid." = "O atributo de distância de direções é inválido.";
"Invalid attribute parameter attribute name (%@)." = "O nome de parâmetro de atributo  (%@) não é válido.";
"Invalid attribute parameter parameter name (%@)." = "O nome de parâmetro de atributo (%@) não é válido.";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Tipo de valor para o atributo (%1$@) parametro (%2$@) inválido.";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valor de uso de restrição para o atributo (%1$@) parametro (%2$@) inválido.";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Valor de uso de restrição para o atributo (%1$@) parametro (%2$@) neutral.";
"Soft restricted element (%@) was traversed." = "Elemento restrito Soft (%@) foi atravessado.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "A rede não possui um atributo de hierarquia para realizar o planeamento hierárquico de rota.";
"No path can be found between a given pair of stops (%@)." = "Não é possível encontrar nenhum caminho entre um determinado par de paragens (%@).";
"The input spatial reference is undefined." = "A referência espacial de entrada não está definida.";
"The output spatial reference is undefined." = "A referência espacial de saída não está definida.";
"The directions style is invalid." = "O estilo de direções é inválido.";
"The directions language is invalid." = "A linguagem de direções é inválida.";
"Directions time and distance attributes do not match." = "Os atributos de tempo e distância não coincidem.";
"The directions road class attribute is invalid." = "O atributo de classse de estrada das direções é inválido.";
"Unknown condition." = "Condição desconhecida.";
"Invalid route task parameters." = "Parâmetros de tarefa de rota inválidos.";
"Route task's solution cannot be found." = "A solução de tarefa de rota não foi encontrada.";
"Route task was cancelled." = "A tarefa de rota foi cancelada.";
"Route task internal error." = "Erro interno de tarefa de rota.";
"Route name property is not supported for local route task." = "A propriedade nome de trota não é suportada pela tarefa de rota local.";
"Local route task parameters should be retrieved from route task." = "Os parâmetros de tarefa de rota local devem ser obtidos pela tarefa de rota.";
"Cannot retrieve network description." = "Não é possível obter descrição da rede.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Apenas um atributo de distância pode ser definido como impedanceAttributeName e accumulateAttributeNames.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Apenas um atributo de tempo pode ser definido como impedanceAttributeName e accumulateAttributeNames.";
"Service not supported." = "O Serviço não é suportado.";
"Specified start time occurs before January 1, 1970." = "A data de início especificada ocorre antes de 1 de Janeiro de 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Parar (%@) tem uma data de início que ocorre antes de 1 de Janeiro de 1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Parar (%@) tem uma janela de tempo local que ocorre antes de 1 de Janeiro de 1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Parar (%@) tem uma janela de tempo UTC que ocorre antes de 1 de Janeiro de 1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "Parar (%@) tem um final de janela de tempo que ocorre antes do início da janela de tempo.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "Desconhecido";
"yd" = "jardas";

/* Unit Display Strings */
"Centimeters" = "Centímetros";
"Decimal Degrees" = "Graus Decimais";
"Decimeters" = "Decímetros";
"Feet" = "Pés";
"Inches" = "Polegadas";
"Kilometers" = "Quilómetros";
"Meters" = "Metros";
"Miles" = "Milhas";
"Millimeters" = "Milímetros";
"Nautical Miles" = "Milhas Náuticas";
"Points" = "Pontos";
"Yards" = "Jardas";

/* Area Units Abbreviated Strings */
"sq. in" = "poleg2";
"sq. ft" = "pés2";
"sq. yd" = "jardas2";
"ac" = "ac";
"sq. mi" = "milhas2";
"sq. mm" = "mm2";
"sq. cm" = "cm2";
"sq. dm" = "dm2";
"sq. m" = "m2";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "km2";

/* Area Units Display Strings */
"Square Inches" = "Polegadas Quadradas";
"Square Feet" = "Pés Quadrados";
"Square Yards" = "Jardas Quadradas";
"Acres" = "Acres";
"Square Miles" = "Milhas Quadradas";
"Square Millimeters" = "Milimetros Quadrados";
"Square Centimeters" = "Centimetros Quadrados";
"Square Decimeters" = "Decimetros Quadrados";
"Square Meters" = "Metros Quadrados";
"Ares" = "Ares";
"Hectares" = "Hectares";
"Square Kilometers" = "Quilómetros Quadrados";

/* Errors */
"Error" = "Erro";
"Class not @protocol AGSCoding compliant" = "Classe não @protocol AGSCoding compatível";
"Authorization required" = "Autorização necessária";
"Token is invalid or has expired" = "Token inválido ou expirou";
"Unknown error occurred" = "Ocorreu um erro desconhecido";
"Empty username/password" = "Nome de utilizador/palavra-passe vazios";
"Token URL is nil. You must set a valid token URL on the credential." = "O URL do Token é nulo. Deve definir um URL de token válido na credencial.";
"Unknown authentication error" = "Erro de autenticação desconhecido";
"Error extracting identity" = "Erro ao extrair a idendidade";
"Error adding identity to the keychain" = "Erro ao adicionar a idendidade ao keychain";
"Invalid Credentials" = "Credenciais Inválidas";
"Bad URL." = "URL Errado.";
"The feature layer does not expose an object-id field." = "A camada de elemento não possui um campo object-id.";
"Both geodatabase and syncParams are required for this method." = "Quer a geodatabase como o syncParams são necessários para este método.";
"Uploading deltas is not supported with this replica." = "O Upload dos deltas não é suportado com esta replica.";
"Error creating delta geodatabase" = "Erro na criação de um delta geodatabase";
"Unable to create result image layer" = "Não foi possível criar uma camada de imagem  de resultado";
"Cache at path '%@' not found." = "Cache no caminho '%@' não encontrado.";
"To add an item, you must be logged in to the portal." = "Para adicionar um item, deve ter a sessão iniciada no portal.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Para adicionar um item, deve especificar o valor no AGSPortalItemContentParameters.";
"The portal failed to add the item." = "O portal falhou ao adicionar o item.";
"To delete an item, you must be logged in to the portal." = "Para eliminar um item, deve ter a sessão iniciada no portal.";
"The portal failed to delete the item." = "O portal falhou ao eliminar o item.";
"To update an item, an itemId and logged in user are required." = "Para atualizar um item, é necessário um itemId e um utilizador com a sessão iniciada.";
"The item failed to update." = "O item falhou na atualização.";
"The item failed to update JSON." = "O item falhou na atualização de JSON.";
"You must be logged in to a portal to add a comment." = "Deve ter a sessão iniciada no portal para adicionar comentários.";
"The comment failed to be added." = "O comentário falhou ao ser adicionado.";
"You must be logged in to a portal to fetch the current user's rating." = "Deve ter a sessão iniciada no portal para visualizar a avaliação do utilizador atual.";
"You must be logged in to a portal to add a rating." = "Deve ter a sessão iniciada para adicionar uma avaliação.";
"The rating failed to be added." = "A avaliação falhou ao ser adicionada.";
"To share an item, you must be logged in to the portal." = "Para partilhar um item, deve ter a sessão iniciada no portal.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Para anular a partilha de um item, deve ter a sessão iniciada no portal e especificar os grupos com os quais pretende retirar a partilha do item.";
"Bad Request" = "Pedido mau";
"Credential Required" = "AGSCredential necessário";
"Job not created" = "O Job não foi criado";
"Service did not return a valid URL" = "O serviço não devolve um URL válido";
"Service did not return a file" = "O serviço não devolve o ficheiro";
"Service did not return a size" = "O servico não devolve o tamanho";
"Job failed" = "Processo falado";
"Job timed out" = "Tempo do processo expirou";
"Job was cancelled" = "Processo cancelado";
"Job was deleted" = "Processo eliminado";
"Feature with objectId: %d not found" = "O elemento com o objectId: %d não foi encontrado";
"No object-id values specified for feature table query." = "Nenhum valor object-id foi especificado para esta consulta a tabela de elementos.";

/* OAuth */
"The specified clientID is invalid" = "O clientID específico é inválido";

/* Sync */
"Upload is not supported with this service." = "O carregamento de dados não é suportado neste serviço.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Para iniciar a sincronização, é necessáriio definir uma direcção de sincronização diferente de AGSGDBSyncDirectionNone.";